app/views/adminsters/show_user.html.erb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 8]]
---
					<div class="col-xs-6">
		    <% order.order_items.each do |order_item| %>