app/views/carts/show.html.erb

					<% sum_count = 0 %>
					<% if current_user.carts.each do |cart_item| %>
---
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ?  [["user_id", 4]]