app/controllers/carts_controller.rb

	def create
		@cart = Cart.new(cart_params)
		@cart.user_id = current_user.id
		@cart.save
---
INSERT INTO "carts" ("user_id", "item_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 4], ["item_id", 1], ["quantity", 1], ["created_at", "2017-12-20 11:29:02.171311"], ["updated_at", "2017-12-20 11:29:02.171311"]]