app/controllers/items_controller.rb

INSERT INTO "items" ("adminster_id", "artist_name", "artist_name_kana", "album_name", "cd_image_id", "price", "label_name", "genre", "stock", "luanch_date", "editor", "item_status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@item = Item.new(item_params)
		redirect_to items_path
		@item.adminster_id = current_adminster.id
		if @item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "items" SET "artist_name" = ?, "cd_image_id" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["artist_name", "cccccc"], ["cd_image_id", "3cc63143a11ac72270564037f7a1a211aeca346133256c730d4a89ee45f1"], ["updated_at", "2017-12-21 08:24:00.343836"], ["id", 2]]
---
	def update
		@item = Item.find(params[:id])
		@item.update(item_params)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "active" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["active", "f"], ["updated_at", "2017-12-23 01:37:42.626336"], ["id", 1]]
---
	def destroy
		@item = Item.find(params[:id])
		@item.update_attribute(:active, false)