app/controllers/orders_controller.rb

INSERT INTO "orders" ("user_id", "billing_first_name", "billing_last_name", "billing_first_name_kana", "billing_last_name_kana", "billing_post_code", "billing_phone", "billing_address", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = ?  [["user_id", 4]]
INSERT INTO "order_items" ("order_id", "item_id", "subtotal", "status", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["order_id", 3], ["item_id", 1], ["subtotal", 1900], ["status", 1], ["quantity", 1], ["created_at", "2017-12-20 11:45:49.832432"], ["updated_at", "2017-12-20 11:45:49.832432"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 4]]
---
    def create
        @user = current_user
        # @user_valid = current_user
        @order = current_user.orders.new(order_params)
        @order.billing_first_name = params[:order][:billing_first_name]
        @order.billing_last_name = params[:order][:billing_last_name]
        @order.billing_first_name_kana = params[:order][:billing_first_name_kana]
        @order.billing_last_name_kana = params[:order][:billing_last_name_kana]
        @order.billing_post_code = params[:order][:billing_post_code]
        @order.billing_phone = params[:order][:billing_phone]
        @order.billing_address = params[:order][:billing_address]
        @order.status = 0

        if @order.save

            sum_count = 0
            current_user.carts.each do |cart|
                @order_item = @order.order_items.new
                @order_item.item_id = cart.item_id
                @order_item.subtotal = cart.quantity*cart.item.price
                @order_item.status = cart.item.item_status
                @order_item.quantity = cart.quantity
                sum_count += @order_item.subtotal
                @order.billing_first_name = params[:order][:billing_first_name]
                @order.total = sum_count
                @order_item.save
                @order.save
                cart.delete