app/controllers/top_controller.rb

SELECT  "items".* FROM "items" LIMIT ? OFFSET ?  [["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items"
---
  def index
  	@items = Item.page(params[:page]).per(8)