app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."user_id" = ? ORDER BY "orders"."id" DESC LIMIT ? OFFSET ?  [["user_id", 4], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 4]]
---
	def show
		@user = User.find(params[:id])
		@orders = @user.orders.page(params[:page]).reverse_order

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = ?, "last_name" = ?, "first_name_kana" = ?, "last_name_kana" = ?, "post_code" = ?, "address" = ?, "phone" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", ""], ["last_name", ""], ["first_name_kana", ""], ["last_name_kana", ""], ["post_code", ""], ["address", ""], ["phone", ""], ["updated_at", "2017-12-15 11:54:12.385388"], ["id", 1]]
---
	def update
		@user = User.find(params[:id])
  	if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "users" SET "leave" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["leave", "f"], ["updated_at", "2017-12-23 01:59:11.400213"], ["id", 6]]
---
	def destroy
		user = User.find(params[:id])
        user.update_attribute(:leave, false)